IDEA Open Model
LoadImpulse Structure
Compatible with IDEA StatiCa 20.1
 LoadImpulse
 Namespace: IdeaRS.OpenModel.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public struct LoadImpulse
Public Structure LoadImpulse
The LoadImpulse type exposes the following members.
Properties
Name | Description
X
 Load in X direction
Y
 Load in Y direction
Z
 Load in Z direction
Top
See Also
Reference
IdeaRS.OpenModel.Loading Namespace